# Merging Data

* **merge()** extends **concat()** with the ability to align rows using multiple columns

## 1. Merging DataFrames

In [1]:
pa_zipcode_population = {'Zipcode': [16855, 15681, 18657, 17307, 15635],
                         '2010 Census Population': [282, 5241, 11985, 5899, 220]}
pa_zipcode_city = {'Zipcode': [17545,18455, 17307, 15705, 16833, 16220, 18618, 16855, 16623, 15635, 15681, 18657, 15279, 17231, 18821],
                   'City': ['MANHEIM', 'PRESTON PARK', 'BIGLERVILLE', 'INDIANA', 'CURWENSVILLE', 'CROWN', 'HARVEYS LAKE', 'MINERAL SPRINGS',
                            'CASSVILLE', 'HANNASTOWN', 'SALTSBURG', 'TUNKHANNOCK', 'PITTSBURG', 'LEMASTERS', 'GREAT BEND'],
                   'State': ['PA', 'PA', 'PA', 'PA', 'PA', 'PA', 'PA', 'PA', 'PA', 'PA', 'PA', 'PA', 'PA', 'PA', 'PA']}

### 1.1. Population DataFrame

In [2]:
import pandas as pd
population = pd.DataFrame.from_dict(pa_zipcode_population)
population

   Zipcode  2010 Census Population
0    16855                     282
1    15681                    5241
2    18657                   11985
3    17307                    5899
4    15635                     220

## 1.2. Cities DataFrames

In [3]:
cities = pd.DataFrame.from_dict(pa_zipcode_city)
cities

    Zipcode             City State
0     17545          MANHEIM    PA
1     18455     PRESTON PARK    PA
2     17307      BIGLERVILLE    PA
3     15705          INDIANA    PA
4     16833     CURWENSVILLE    PA
5     16220            CROWN    PA
6     18618     HARVEYS LAKE    PA
7     16855  MINERAL SPRINGS    PA
8     16623        CASSVILLE    PA
9     15635       HANNASTOWN    PA
10    15681        SALTSBURG    PA
11    18657      TUNKHANNOCK    PA
12    15279        PITTSBURG    PA
13    17231        LEMASTERS    PA
14    18821       GREAT BEND    PA

## 1.3. Merging

* pd.merge() computes a merge on ALL columns that occur in both DataFrames
 * in the following case, the common column is Zipcode
 * for any row in which the **Zipcode** entry in cities matches a row in population, a new row is made in the merged DataFrame.
 * by default, this is an inner join
   * it's an inner join because it glues together only rows that match in the joining columns of **BOTH** DataFrames

In [4]:
pd.merge(population, cities)
#pd.merge(df1,df2)

   Zipcode  2010 Census Population             City State
0    16855                     282  MINERAL SPRINGS    PA
1    15681                    5241        SALTSBURG    PA
2    18657                   11985      TUNKHANNOCK    PA
3    17307                    5899      BIGLERVILLE    PA
4    15635                     220       HANNASTOWN    PA

## 1.4. Medal DataFrames

In [6]:
bronze = pd.read_csv('/Users/alimbekov/Desktop/Gaukhar/2024-2025/Python for Data Analysis/practice/Summer Olympic medals/Bronze.csv')
bronze.head()

   NOC         Country   Total
0  USA   United States  1052.0
1  URS    Soviet Union   584.0
2  GBR  United Kingdom   505.0
3  FRA          France   475.0
4  GER         Germany   454.0

In [7]:
len(bronze)

138

In [8]:
gold = pd.read_csv('/Users/alimbekov/Desktop/Gaukhar/2024-2025/Python for Data Analysis/practice/Summer Olympic medals/Gold.csv')
gold.head()

   NOC         Country   Total
0  USA   United States  2088.0
1  URS    Soviet Union   838.0
2  GBR  United Kingdom   498.0
3  FRA          France   378.0
4  GER         Germany   407.0

In [9]:
len(gold)

138

## 1.5. Merging all columns

* by default, pd.merge() uses all columns common to both DataFrames to merge
* the rows of the merged DataFrame consist of all rows where the **NOC**, **Country**, and **Totals** columns are identical in both DataFrames

In [10]:
so_merge = pd.merge(bronze, gold)
so_merge.head()

   NOC     Country  Total
0  ESP       Spain   92.0
1  IRL     Ireland    8.0
2  SYR       Syria    1.0
3  MOZ  Mozambique    1.0
4  SUR    Suriname    1.0

In [11]:
len(so_merge)

18

In [12]:
so_merge.columns

Index(['NOC', 'Country', 'Total'], dtype='object')

In [13]:
so_merge.index

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17], dtype='int64')

## 1.6. Merging on

In [14]:
so_merge = pd.merge(bronze, gold, on='NOC') # x - bronze, y= gold
so_merge.head()

   NOC       Country_x  Total_x       Country_y  Total_y
0  USA   United States   1052.0   United States   2088.0
1  URS    Soviet Union    584.0    Soviet Union    838.0
2  GBR  United Kingdom    505.0  United Kingdom    498.0
3  FRA          France    475.0          France    378.0
4  GER         Germany    454.0         Germany    407.0

In [15]:
len(so_merge)

138

## 1.7. Merging on multiple columns

* this is where merging extend concatenation in allowing matching on multiple columns

In [16]:
so_merge = pd.merge(bronze, gold, on=['NOC', 'Country'])
so_merge.head()

   NOC         Country  Total_x  Total_y
0  USA   United States   1052.0   2088.0
1  URS    Soviet Union    584.0    838.0
2  GBR  United Kingdom    505.0    498.0
3  FRA          France    475.0    378.0
4  GER         Germany    454.0    407.0

## 1.8  Using suffixes

In [17]:
so_merge = pd.merge(bronze, gold, on=['NOC', 'Country'], suffixes=['_bron', '_gld'])
so_merge.head()

   NOC         Country  Total_bron  Total_gld
0  USA   United States      1052.0     2088.0
1  URS    Soviet Union       584.0      838.0
2  GBR  United Kingdom       505.0      498.0
3  FRA          France       475.0      378.0
4  GER         Germany       454.0      407.0

## 1.9  Countries DataFrame

In [18]:
pa_counties = {'CITY NAME': ['SALTSBURG', 'MINERAL SPRINGS', 'BIGLERVILLE', 'HANNASTOWN', 'TUNKHANNOCK'],
               'COUNTY NAME': ['INDIANA', 'CLEARFIELD', 'ADAMS', 'WESTMORELAND', 'WYOMING']}
counties = pd.DataFrame.from_dict(pa_counties)
counties

         CITY NAME   COUNTY NAME
0        SALTSBURG       INDIANA
1  MINERAL SPRINGS    CLEARFIELD
2      BIGLERVILLE         ADAMS
3       HANNASTOWN  WESTMORELAND
4      TUNKHANNOCK       WYOMING

In [19]:
cities.tail()

    Zipcode         City State
10    15681    SALTSBURG    PA
11    18657  TUNKHANNOCK    PA
12    15279    PITTSBURG    PA
13    17231    LEMASTERS    PA
14    18821   GREAT BEND    PA

## 1.10  Specifying columns to merge

In [20]:
pd.merge(counties, cities, left_on='CITY NAME', right_on='City')

         CITY NAME   COUNTY NAME  Zipcode             City State
0        SALTSBURG       INDIANA    15681        SALTSBURG    PA
1  MINERAL SPRINGS    CLEARFIELD    16855  MINERAL SPRINGS    PA
2      BIGLERVILLE         ADAMS    17307      BIGLERVILLE    PA
3       HANNASTOWN  WESTMORELAND    15635       HANNASTOWN    PA
4      TUNKHANNOCK       WYOMING    18657      TUNKHANNOCK    PA

## 1.11  Switching left/right DataFrames

In [21]:
pd.merge(cities, counties, left_on='City', right_on='CITY NAME')

   Zipcode             City State        CITY NAME   COUNTY NAME
0    17307      BIGLERVILLE    PA      BIGLERVILLE         ADAMS
1    16855  MINERAL SPRINGS    PA  MINERAL SPRINGS    CLEARFIELD
2    15635       HANNASTOWN    PA       HANNASTOWN  WESTMORELAND
3    15681        SALTSBURG    PA        SALTSBURG       INDIANA
4    18657      TUNKHANNOCK    PA      TUNKHANNOCK       WYOMING

# 2. Exercise:

### 2.1.   Merging company DataFrames
    Suppose your company has operations in several different cities under several different managers. The DataFrames revenue and managers contain partial information related to the company. That is, the rows of the city columns don't quite match in revenue and managers (the Mendocino branch has no revenue yet since it just opened and the manager of Springfield branch recently left the company).

    The DataFrames have been printed / If you were to run the command combined = pd.merge(revenue, managers, on='city'), how many rows would combined have?

In [22]:
rev = {'city': ['Austin', 'Denver', 'Springfield'], 'revenue': [100, 83, 4]}
man = {'city': ['Austin', 'Denver', 'Mendocino'], 'manager': ['Charles', 'Joel', 'Brett']}

# 3. Joining DataFrames

* Pandas has to search through DataFrame rows for matches when computing joins and merges
  * It's useful to have different kinds of joins to mitigate costs

###  3.1  Medal DataFrames

In [23]:

bronze.head()

   NOC         Country   Total
0  USA   United States  1052.0
1  URS    Soviet Union   584.0
2  GBR  United Kingdom   505.0
3  FRA          France   475.0
4  GER         Germany   454.0

### 3.2  Merging with inner join

* merge() does an inner join by default
  * it extracts the rows that match in joining columns from both DataFrames and it glues them together in the joined DataFrame
  * the property how=inner is the default behavior

In [24]:
so_merge = pd.merge(bronze, gold, on=['NOC', 'Country'], suffixes=['_bronze', '_gold'], how='inner')
so_merge.head()

   NOC         Country  Total_bronze  Total_gold
0  USA   United States        1052.0      2088.0
1  URS    Soviet Union         584.0       838.0
2  GBR  United Kingdom         505.0       498.0
3  FRA          France         475.0       378.0
4  GER         Germany         454.0       407.0

### 3.3  Merging with left join

* using how=left keeps all rows of the left DataFrame in the merged DataFrame
* Keeps all rows of the left DF in the merged DF
* For rows in the left DF with matches in the right DF:
  * Non-joining columns of right DF are appended to left DF
* For rows in the left DF with no matches in the right DF:
  * Non-joining columns are filled with nulls

In [26]:
bronze = pd.read_csv('/Users/alimbekov/Desktop/Gaukhar/2024-2025/Python for Data Analysis/practice/Summer Olympic medals/bronze_top5.csv')

In [27]:
gold = pd.read_csv('/Users/alimbekov/Desktop/Gaukhar/2024-2025/Python for Data Analysis/practice/Summer Olympic medals/gold_top5.csv')

In [28]:
g_noc = ['USA', 'URS', 'GBR', 'ITA', 'GER']
b_noc = ['USA', 'URS', 'GBR', 'FRA', 'GER']

In [29]:
gold['NOC'] = g_noc
bronze['NOC'] = b_noc

In [30]:
gold

          Country   Total  NOC
0   United States  2088.0  USA
1    Soviet Union   838.0  URS
2  United Kingdom   498.0  GBR
3           Italy   460.0  ITA
4         Germany   407.0  GER

In [31]:
bronze

          Country   Total  NOC
0   United States  1052.0  USA
1    Soviet Union   584.0  URS
2  United Kingdom   505.0  GBR
3          France   475.0  FRA
4         Germany   454.0  GER

In [32]:
pd.merge(bronze, gold, on=['NOC', 'Country'], suffixes=['_bronze', '_gold'], how='left')

          Country  Total_bronze  NOC  Total_gold
0   United States        1052.0  USA      2088.0
1    Soviet Union         584.0  URS       838.0
2  United Kingdom         505.0  GBR       498.0
3          France         475.0  FRA         NaN
4         Germany         454.0  GER       407.0

### 3.4  Merging with right join

In [33]:
pd.merge(bronze, gold, on=['NOC', 'Country'], suffixes=['_bronze', '_gold'], how='right')

          Country  Total_bronze  NOC  Total_gold
0   United States        1052.0  USA      2088.0
1    Soviet Union         584.0  URS       838.0
2  United Kingdom         505.0  GBR       498.0
3           Italy           NaN  ITA       460.0
4         Germany         454.0  GER       407.0

### 3.5  Merging with outer join

In [34]:
pd.merge(bronze, gold, on=['NOC', 'Country'], suffixes=['_bronze', '_gold'], how='outer')

          Country  Total_bronze  NOC  Total_gold
0   United States        1052.0  USA      2088.0
1    Soviet Union         584.0  URS       838.0
2  United Kingdom         505.0  GBR       498.0
3          France         475.0  FRA         NaN
4         Germany         454.0  GER       407.0
5           Italy           NaN  ITA       460.0

### 3.6  Population & unemployment data

In [35]:
population = pd.DataFrame.from_dict({'Zip Code ZCTA': [57538, 59916, 37660, 2860],
                                     '2010 Census Population': [322, 130, 40038, 45199]})
population.set_index('Zip Code ZCTA', inplace=True)
population

               2010 Census Population
Zip Code ZCTA
57538                             322
59916                             130
37660                           40038
2860                            45199

In [36]:
unemployment = pd.DataFrame.from_dict({'Zip': [2860, 46167, 1097],
                                       'unemployment': [0.11, 0.02, 0.33],
                                       'participants': [ 34447, 4800, 32]})
unemployment.set_index('Zip', inplace=True)
unemployment

       unemployment  participants
Zip
2860           0.11         34447
46167          0.02          4800
1097           0.33            32

### 3.7  Using .join(how='left')

* computes a left join using the Index by default

In [37]:
population.join(unemployment)

               2010 Census Population  unemployment  participants
Zip Code ZCTA
57538                             322           NaN           NaN
59916                             130           NaN           NaN
37660                           40038           NaN           NaN
2860                            45199          0.11       34447.0

### 3.8  Using .join(how='right')

In [38]:
population.join(unemployment, how='right')

       2010 Census Population  unemployment  participants
Zip
2860                  45199.0          0.11         34447
46167                     NaN          0.02          4800
1097                      NaN          0.33            32

### 3.9  Using .join(how='inner')

In [39]:
population.join(unemployment, how='inner')

      2010 Census Population  unemployment  participants
2860                   45199          0.11         34447

### 3.10  Using .join(how='outer')

In [40]:
population.join(unemployment, how='outer')

       2010 Census Population  unemployment  participants
1097                      NaN          0.33          32.0
2860                  45199.0          0.11       34447.0
37660                 40038.0           NaN           NaN
46167                     NaN          0.02        4800.0
57538                   322.0           NaN           NaN
59916                   130.0           NaN           NaN

# 4. Exercises

## 4.1  Data

In [41]:
rev = {'city': ['Austin', 'Denver', 'Springfield', 'Mendocino'],
       'state': ['TX','CO','IL','CA'],
       'revenue': [100, 83, 4, 200],
       'branch_id': [10, 20, 30, 47]}

man = {'city': ['Austin', 'Denver', 'Mendocino', 'Springfield'],
       'state': ['TX','CO','CA','MO'],
       'manager': ['Charles', 'Joel', 'Brett', 'Sally'],
       'branch_id': [10, 20, 47, 31]}

revenue = pd.DataFrame.from_dict(rev)
revenue.set_index('branch_id', inplace=True)
managers = pd.DataFrame.from_dict(man)
managers.set_index('branch_id', inplace=True)

In [42]:
revenue

                  city state  revenue
branch_id
10              Austin    TX      100
20              Denver    CO       83
30         Springfield    IL        4
47           Mendocino    CA      200

In [43]:
managers

                  city state  manager
branch_id
10              Austin    TX  Charles
20              Denver    CO     Joel
47           Mendocino    CA    Brett
31         Springfield    MO    Sally

## 4.2  Joining by Index

The DataFrames revenue and managers are displayed. Here, they are indexed by 'branch_id'.

Choose the function call below that will join the DataFrames on their indexes and return 5 rows with index labels [10, 20, 30, 31, 47]. Explore each of them in the IPython Shell to get a better understanding of their functionality.

In [44]:
revenue.join(managers, lsuffix='_rev', rsuffix='_mng', how='outer')

              city_rev state_rev  revenue     city_mng state_mng  manager
branch_id
10              Austin        TX    100.0       Austin        TX  Charles
20              Denver        CO     83.0       Denver        CO     Joel
30         Springfield        IL      4.0          NaN       NaN      NaN
31                 NaN       NaN      NaN  Springfield        MO    Sally
47           Mendocino        CA    200.0    Mendocino        CA    Brett

##  4.3  Choosing a joining strategy

Suppose you have two DataFrames: students (with columns 'StudentID', 'LastName', 'FirstName', and 'Major') and midterm_results (with columns 'StudentID', 'Q1', 'Q2', and 'Q3' for their scores on midterm questions).

You want to combine the DataFrames into a single DataFrame grades, and be able to easily spot which students wrote the midterm and which didn't (their midterm question scores 'Q1', 'Q2', & 'Q3' should be filled with NaN values).

You also want to drop rows from midterm_results in which the StudentID is not found in students.

Which of the following strategies gives the desired result?

In [45]:
students = pd.DataFrame.from_dict({'StudentID': [], 'LastName': [], 'FirstName': [], 'Major': []})
midterm_results = pd.DataFrame.from_dict({'StudentID': [], 'Q1': [], 'Q2': [], 'Q3': []})

In [46]:
students

Empty DataFrame
Columns: [StudentID, LastName, FirstName, Major]
Index: []

In [47]:
midterm_results

Empty DataFrame
Columns: [StudentID, Q1, Q2, Q3]
Index: []

In [48]:
grades = pd.merge(students, midterm_results, how='left')

##  4.4  Left & right merging on multiple columns
You now have, in addition to the revenue and managers DataFrames from prior exercises, a DataFrame sales that summarizes units sold from specific branches (identified by city and state but not branch_id).

Once again, the managers DataFrame uses the label branch in place of city as in the other two DataFrames. Your task here is to employ left and right merges to preserve data and identify where data is missing.

By merging revenue and sales with a right merge, you can identify the missing revenue values. Here, you don't need to specify left_on or right_on because the columns to merge on have matching labels.

By merging sales and managers with a left merge, you can identify the missing manager. Here, the columns to merge on have conflicting labels, so you must specify left_on and right_on. In both cases, you're looking to figure out how to connect the fields in rows containing Springfield.

pandas has been imported as pd and the three DataFrames revenue, managers, and sales have been pre-loaded. They have been printed for you to explore in the IPython Shell.

**Instructions**

* Execute a right merge using pd.merge() with revenue and sales to yield a new DataFrame revenue_and_sales.
   * Use how='right' and on=['city', 'state'].
* Print the new DataFrame revenue_and_sales. This has been done for you.
* Execute a left merge with sales and managers to yield a new DataFrame sales_and_managers.
   * Use how='left', left_on=['city', 'state'], and right_on=['branch', 'state'].
* Print the new DataFrame sales_and_managers.

In [49]:
rev = {'city': ['Austin', 'Denver', 'Springfield', 'Mendocino'],
       'branch_id': [10, 20, 30, 47],
       'state': ['TX','CO','IL','CA'],
       'revenue': [100, 83, 4, 200]}

man = {'branch': ['Austin', 'Denver', 'Mendocino', 'Springfield'],
       'branch_id': [10, 20, 47, 31],
       'state': ['TX','CO','CA','MO'],
       'manager': ['Charles', 'Joel', 'Brett', 'Sally']}

sale = {'city': ['Mendocino', 'Denver', 'Austin', 'Springfield', 'Springfield'],
        'state': ['CA', 'CO', 'TX', 'MO', 'IL'],
        'units': [1, 4, 2, 5, 1]}

revenue = pd.DataFrame.from_dict(rev)
managers = pd.DataFrame.from_dict(man)
sales = pd.DataFrame.from_dict(sale)

In [50]:
# Merge revenue and sales: revenue_and_sales

# Merge sales and managers: sales_and_managers

# 5  Ordered merges

## 5.1  Software & hardware sales

In [52]:
software = pd.read_csv('/Users/alimbekov/Desktop/Gaukhar/2024-2025/Python for Data Analysis/practice/Sales/feb-sales-Software.csv', parse_dates=['Date']).sort_values('Date')
software.head(10)

                 Date          Company   Product  Units
2 2015-02-02 08:33:01            Hooli  Software      3
1 2015-02-03 14:14:18          Initech  Software     13
7 2015-02-04 15:36:29        Streeplex  Software     13
3 2015-02-05 01:53:06  Acme Coporation  Software     19
5 2015-02-09 13:09:55        Mediacore  Software      7
4 2015-02-11 20:03:08          Initech  Software      7
6 2015-02-11 22:50:44            Hooli  Software      4
0 2015-02-16 12:09:19            Hooli  Software     10
8 2015-02-21 05:01:26        Mediacore  Software      3

In [53]:
hardware = pd.read_csv('/Users/alimbekov/Desktop/Gaukhar/2024-2025/Python for Data Analysis/practice/Sales/feb-sales-Hardware.csv', parse_dates=['Date']).sort_values('Date')
hardware.head()

                 Date          Company   Product  Units
3 2015-02-02 20:54:49        Mediacore  Hardware      9
0 2015-02-04 21:52:45  Acme Coporation  Hardware     14
1 2015-02-07 22:58:10  Acme Coporation  Hardware      1
2 2015-02-19 10:59:33        Mediacore  Hardware     16
4 2015-02-21 20:41:47            Hooli  Hardware      3

## 5.2  Using merge()

* attempting to merge yields an empty DataFrame because it's doing an INNER join on all columns with matching names by defaults
   * 'Units' and 'Date' columns have no overlapping values, so the result is empty

In [54]:
sales_merge = pd.merge(hardware, software)
sales_merge

Empty DataFrame
Columns: [Date, Company, Product, Units]
Index: []

In [55]:
sales_merge.info()

<class 'pandas.core.frame.DataFrame'>
Index: 0 entries
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Date     0 non-null      datetime64[ns]
 1   Company  0 non-null      object
 2   Product  0 non-null      object
 3   Units    0 non-null      int64
dtypes: datetime64[ns](1), int64(1), object(2)
memory usage: 0.0+ bytes

## 5.3  Using merge(how='outer')

In [56]:
sales_merge = pd.merge(hardware, software, how='outer')
sales_merge.head(14)

                  Date          Company   Product  Units
0  2015-02-02 20:54:49        Mediacore  Hardware      9
1  2015-02-04 21:52:45  Acme Coporation  Hardware     14
2  2015-02-07 22:58:10  Acme Coporation  Hardware      1
3  2015-02-19 10:59:33        Mediacore  Hardware     16
4  2015-02-21 20:41:47            Hooli  Hardware      3
5  2015-02-02 08:33:01            Hooli  Software      3
6  2015-02-03 14:14:18          Initech  Software     13
7  2015-02-04 15:36:29        Streeplex  Software     13
8  2015-02-05 01:53:06  Acme Coporation  Software     19
9  2015-02-09 13:09:55        Mediacore  Software      7
10 2015-02-11 20:03:08          Initech  Software      7
11 2015-02-11 22:50:44            Hooli  Software      4
12 2015-02-16 12:09:19            Hooli  Software     10
13 2015-02-21 05:01:26        Mediacore  Software      3

## 5.4  Sorting merge(how='outer')

In [57]:
sales_merge = pd.merge(hardware, software, how='outer').sort_values('Date')
sales_merge.head(14)

                  Date          Company   Product  Units
5  2015-02-02 08:33:01            Hooli  Software      3
0  2015-02-02 20:54:49        Mediacore  Hardware      9
6  2015-02-03 14:14:18          Initech  Software     13
7  2015-02-04 15:36:29        Streeplex  Software     13
1  2015-02-04 21:52:45  Acme Coporation  Hardware     14
8  2015-02-05 01:53:06  Acme Coporation  Software     19
2  2015-02-07 22:58:10  Acme Coporation  Hardware      1
9  2015-02-09 13:09:55        Mediacore  Software      7
10 2015-02-11 20:03:08          Initech  Software      7
11 2015-02-11 22:50:44            Hooli  Software      4
12 2015-02-16 12:09:19            Hooli  Software     10
3  2015-02-19 10:59:33        Mediacore  Hardware     16
13 2015-02-21 05:01:26        Mediacore  Software      3
4  2015-02-21 20:41:47            Hooli  Hardware      3

# 5.5  Using merge_ordered()

* the default is an OUTER join

In [58]:
sales_merged = pd.merge_ordered(hardware, software)
sales_merged.head(14)

                  Date          Company   Product  Units
0  2015-02-02 08:33:01            Hooli  Software      3
1  2015-02-02 20:54:49        Mediacore  Hardware      9
2  2015-02-03 14:14:18          Initech  Software     13
3  2015-02-04 15:36:29        Streeplex  Software     13
4  2015-02-04 21:52:45  Acme Coporation  Hardware     14
5  2015-02-05 01:53:06  Acme Coporation  Software     19
6  2015-02-07 22:58:10  Acme Coporation  Hardware      1
7  2015-02-09 13:09:55        Mediacore  Software      7
8  2015-02-11 20:03:08          Initech  Software      7
9  2015-02-11 22:50:44            Hooli  Software      4
10 2015-02-16 12:09:19            Hooli  Software     10
11 2015-02-19 10:59:33        Mediacore  Hardware     16
12 2015-02-21 05:01:26        Mediacore  Software      3
13 2015-02-21 20:41:47            Hooli  Hardware      3

## 5.6  Using on & suffixes

In [59]:
sales_merged = pd.merge_ordered(hardware, software, on=['Date', 'Company'], suffixes=['_hardware', '_software'])
sales_merged.head()

,Date,Company,Product_hardware,Units_hardware,Product_software,Units_software
0,2015-02-02 08:33:01,Hooli,NaN,NaN,Software,3.0
1,2015-02-02 20:54:49,Mediacore,Hardware,9.0,NaN,NaN
2,2015-02-03 14:14:18,Initech,NaN,NaN,Software,13.0
3,2015-02-04 15:36:29,Streeplex,NaN,NaN,Software,13.0
4,2015-02-04 21:52:45,Acme Coporation,Hardware,14.0,NaN,NaN

# 6. Exercise

### 6.1. Using merge_ordered()

This exercise uses pre-loaded DataFrames **austin** and **houston** that contain weather data from the cities Austin and Houston respectively. They have been printed in the IPython Shell for you to examine.

Weather conditions were recorded on separate days and you need to merge these two DataFrames together such that the dates are ordered. To do this, you'll use **pd.merge_ordered()**. After you're done, note the order of the rows before and after merging.

**Instructions**

* Perform an ordered merge on austin and houston using pd.merge_ordered(). Store the result as tx_weather.

* Print tx_weather. You should notice that the rows are sorted by the date but it is not possible to tell which observation came from which city.

* Perform another ordered merge on austin and houston.
   
   * This time, specify the keyword arguments on='date' and suffixes=['_aus','_hus'] so that the rows can be distinguished. Store the result as tx_weather_suff.
   
* Print tx_weather_suff to examine its contents. This has been done for you.

* Perform a third ordered merge on austin and houston.

   * This time, in addition to the on and suffixes parameters, specify the keyword argument fill_method='ffill' to use forward-filling to replace NaN entries with the most recent non-null entry

In [60]:
austin = pd.DataFrame.from_dict({'date': ['2016-01-01', '2016-02-08', '2016-01-17'], 'ratings': ['Cloudy', 'Cloudy', 'Sunny']})
houston = pd.DataFrame.from_dict({'date': ['2016-01-04', '2016-01-01', '2016-03-01'], 'ratings': ['Rainy', 'Cloudy', 'Sunny']})

In [61]:
# Perform the first ordered merge: tx_weather
# Perform the second ordered merge: tx_weather_suff
# Perform the third ordered merge: tx_weather_ffill